app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "articles"
---
  def index
      if current_user
        @articles = Article.paginate(:page => params[:page], :per_page => 3)

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    if current_user
      @article = Article.find(params[:id])
      @user = User.find(@article.user_id)

INSERT INTO "articles" ("title", "text", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "rajfsdfs"], ["text", "fdsgdgdfg"], ["user_id", 1], ["created_at", "2015-09-07 05:17:46.498805"], ["updated_at", "2015-09-07 05:17:46.498805"]]
---
  def create
    if current_user
      @article = Article.new(article_params)
      @article.user_id = current_user.id

      if @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "rajfsdfsdfgdfgdfgd"], ["text", "fdsgdgdfgfdg"], ["updated_at", "2015-09-07 06:24:08.488921"], ["id", 1]]
---
  def update
  @article = Article.find(params[:id])

  if @article.update(article_params)

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 2]]
---
 def destroy
   @article = Article.find(params[:id])
   if current_user && @article.user_id == current_user.id
     @article = Article.find(params[:id])
     @article.destroy