app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "fsdfsdf"], ["body", "sfdsdfsd"], ["article_id", 1], ["created_at", "2015-09-04 11:35:51.138959"], ["updated_at", "2015-09-04 11:35:51.138959"]]
---
  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.new(comment_params)
    @comment.commenter = current_user.email
    @comment.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "comments".* FROM "comments" WHERE "comments"."article_id" = ? AND "comments"."id" = ? LIMIT 1  [["article_id", 2], ["id", 4]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 4]]
---
  def destroy
      @article = Article.find(params[:article_id])
      if current_user && @article.user_id == current_user.id
        @comment = @article.comments.find(params[:id])
        @comment.destroy