app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_salt", "password_hash", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    if !current_user
      @user = User.new(user_params)
      if @user.save